Revit 2027 API
FieldValues(IList<ValueAtPoint>, XYZ) Constructor
 Creates object from an array of domain point values
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FieldValues(
	IList<ValueAtPoint> valueAtPoint,
	XYZ unitDirection
)
Public Sub New (
	valueAtPoint As IList(Of ValueAtPoint),
	unitDirection As XYZ
)
public:
FieldValues(
	IList<ValueAtPoint^>^ valueAtPoint,
	XYZ^ unitDirection
)
new :
        valueAtPoint : IList<ValueAtPoint> *
        unitDirection : XYZ -> FieldValues
Parameters
valueAtPoint IList<ValueAtPoint>
 Array of values, each corresponding to a domain point
unitDirection XYZ
 Unit vector that gives the same direction for values (for diagrams)
Exceptions
Exception | Condition
ArgumentException |  Members of valueAtPoint contain different numbers of measurements -or- unitDirection is not a unit vector
ArgumentNullException |  A non-optional argument was null
See Also
Reference
FieldValues Class
FieldValues Overload
Autodesk.Revit.DB.Analysis Namespace